tap "coder/coder"
tap "hashicorp/tap"
tap "tonisives/tap"
brew "libtiff"
brew "jpeg-xl"
brew "bash"
brew "cfn-lint"
brew "cmake"
brew "coder"
brew "docker"
brew "docker-compose"
brew "expect"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gcc@14"
brew "gh"
brew "ghostscript"
brew "git"
brew "go"
brew "graphviz"
brew "gstreamer"
brew "hugo"
brew "hyperfine"
brew "juliaup"
brew "libheif"
brew "libraw"
brew "llvm"
brew "lld"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "node"
brew "mongosh"
brew "ncspot"
brew "tree-sitter"
brew "neovim"
brew "pixi"
brew "pngpaste"
brew "ripgrep"
brew "ruby"
brew "stylua"
brew "swig"
brew "tex-fmt"
brew "texlab"
brew "tmux"
brew "typos-lsp"
brew "uv"
brew "vim"
brew "zk"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
cask "font-hack-nerd-font"
cask "git-credential-manager"
cask "karabiner-elements"
cask "mactex"
cask "rectangle"
cask "wezterm"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "julialang.language-julia"
vscode "mechatroner.rainbow-csv"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.tensorboard"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "redhat.vscode-yaml"
vscode "rickaym.manim-sideview"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
cargo "rustlings"
cargo "wiki-tui"
uv "basedpyright"
uv "ipython"
uv "jupyter-client"
uv "maturin"
uv "pylatexenc"
uv "pynvim"
uv "ruff"
uv "ty"
