tap "coder/coder"
tap "hashicorp/tap"
tap "localstack/tap"
brew "libtiff"
brew "jpeg-xl"
brew "cfn-lint"
brew "cmake"
brew "coder"
brew "docker"
brew "docker-compose"
brew "expect"
brew "ffmpeg"
brew "gh"
brew "ghostscript"
brew "git"
brew "go"
brew "graphviz"
brew "gstreamer"
brew "hugo"
brew "hyperfine"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "juliaup"
brew "llvm"
brew "lld"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "node"
brew "mongosh"
brew "ncspot"
brew "tree-sitter"
brew "neovim"
brew "pixi"
brew "pngpaste"
brew "pympress"
brew "ripgrep"
brew "ruby"
brew "stylua"
brew "swig"
brew "tmux"
brew "typos-lsp"
brew "uv"
brew "vim"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
cask "font-hack-nerd-font"
cask "git-credential-manager"
cask "karabiner-elements"
cask "rectangle"
cask "wezterm"
vscode "astral-sh.ty"
vscode "asvetliakov.vscode-neovim"
vscode "boto3typed.boto3-ide"
vscode "charliermarsh.ruff"
vscode "coder.coder-remote"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "julialang.language-julia"
vscode "mechatroner.rainbow-csv"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.tensorboard"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-yaml"
vscode "rickaym.manim-sideview"
vscode "tomoki1207.pdf"
vscode "wayou.vscode-todo-highlight"
